kiloser/STM32F0/tag/tag01/Src/main.c

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
/* USER CODE BEGIN Includes */
#include "main.h"


/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim14;
TIM_HandleTypeDef htim16;

UART_HandleTypeDef huart1;
//#define NEW
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/


static dwt_config_t config = {
    2,               /* Channel number. */
    DWT_PRF_64M,     /* Pulse repetition frequency. */
    DWT_PLEN_1024,   /* Preamble length. */
    DWT_PAC32,       /* Preamble acquisition chunk size. Used in RX only. */
    9,               /* TX preamble code. Used in TX only. */
    9,               /* RX preamble code. Used in RX only. */
    1,               /* Use non-standard SFD (Boolean) */
    DWT_BR_110K,     /* Data rate. */
    DWT_PHRMODE_STD, /* PHY header mode. */
    (1025 + 64 - 32) /* SFD timeout (preamble length + 1 + SFD length - PAC size). Used in RX only. */
};
/* USER CODE END PV */

void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_SPI1_Init(void);
static void MX_TIM14_Init(void);
static void MX_TIM16_Init(void);

static uint32 len;
static uint8 tag_id[2] ={0x00,0x02};
static uint8 tx_frame_acked = 0;//自动应答响应标志位 1收到 0未收到
static uint8 issync=0;//同步时间戳标志位 1收到 0未收到
static uint16 tag_delay=450;
static uint8 tx_poll_msg[] = {0x26, 0x17, 0x26, 0x16, 0x33, 0, 0, 0, 0, 0};
static uint8 rx_resp_msg[] = {0x26, 0x17, 0x26, 0x16, 0x44, 0, 0, 0, 0, 0, 0, 0};
static uint8 tx_final_msg[] = {0x26, 0x17, 0x26, 0x16, 0x55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,0,0,0,0,0,
0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
static uint8 tx_tell_msg[] = {0x26, 0x17, 0x26, 0x16, 0x66, 0, 0, 0, 0, 0, 0, 0, 0, 0};
static uint8 poll_time_msg[] = {0x26,0x17,0x26,0x16,0x99,0,0,0,0,0,0,0,0,0};
static uint8 rx_buffer[RX_BUF_LEN];
static uint32 status_reg = 0;	

static uint8 send_count=0;
static uint8 final_ok =0;
static uint8 interrupt_triggered =0;
static uint8 received =0;		
static uint8 RF_timeout=0;
static uint8 wearing=0;
uint32 localtime=0;//本地时间 在TIM14中断中每1ms增加1
uint32 acTime=0;
uint16 startCnt=0;
uint16 cnta=0;
uint8_t usart_rx_buff[64];//串口buff
uint32 startTime=1;
uint8 syncCnt=0;
uint8 startFlag=0;
uint8 flag10s=0;
uint16 cntx=0;



typedef unsigned long long uint64;
static uint64 poll_tx_ts;
static uint64 resp_rx_ts;
static uint64 final_tx_ts;

/*online timestamp*/
static uint64 online_tx_ts;
static uint32 tag_order=1;

uint32 start_frame_len;

static uint8 dummy_buffer[DUMMY_BUFFER_LEN];
/* Private function prototypes -----------------------------------------------*/


/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
static void EXTI2_3_IRQHandler_Config(void);
static uint64 get_tx_timestamp_u64(void);
static uint64 get_rx_timestamp_u64(void);
static void final_msg_set_ts(uint8 *ts_field, uint64 ts);
void dw_setARER(int);
void Frame_Ack(void);
void POLL_TimeWindow(void);

usart_bitfield USART_STA={
	0,
	0,
	0
};//串口接受狀態
char newdata=0;

/* USER CODE END PFP */



/* USER CODE END 0 */

int main(void)
{    

  /* USER CODE BEGIN 1 */
	uint16 lp_osc_freq, sleep_cnt;
  /* USER CODE END 1 */
	uint8 leftstatus=0;
	uint8 rightstatus=0;
  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
	

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_SPI2_Init();
  MX_SPI1_Init();
	MX_TIM14_Init();
	MX_TIM16_Init();
	
#ifdef	FLASHPROTECT
	HAL_FLASH_Unlock();
	HAL_FLASH_OB_Unlock();
		#ifdef MAXRDPLEVEL
		FLASH_OB_RDP_LevelConfig(OB_RDP_Level_2);
		#else
		FLASH_OB_RDP_LevelConfig((uint8_t)0xBB);
		#endif
	HAL_FLASH_OB_Lock();
	HAL_FLASH_Lock();
#endif

//  HAL_TIM_Base_Start_IT(&htim14);
//	HAL_TIM_Base_Start_IT(&htim16);
	delay_init();
	usmart_init(48);//in this case, parameter is useless
	HAL_UART_Receive_IT(&huart1, usart_rx_buff, 64);
	
	EXTI->PR = 0x7bffff;//clear pending bits
	EXTI2_3_IRQHandler_Config();
	memcpy(&tx_poll_msg[TAG_ID_IDX],tag_id,ID_LEN);
	memcpy(&rx_resp_msg[TAG_ID_IDX],tag_id,ID_LEN);
	memcpy(&tx_final_msg[TAG_ID_IDX],tag_id,ID_LEN);
	memcpy(&tx_tell_msg[TAG_ID_IDX],tag_id,ID_LEN);
	reset_DW1000();
	HAL_TIM_Base_Start_IT(&htim14);
	HAL_TIM_Base_Start_IT(&htim16);
	/**************************************************/
	/*change*/
	dwt_spicswakeup(dummy_buffer, DUMMY_BUFFER_LEN);
	if (dwt_initialise(DWT_LOADUCODE) == DWT_ERROR)
			{
					printf("INIT FAILED\r\n");
					while (1)
					{ };
			}
			
	dwt_configure(&config);
	/* Clear reception timeout to start next ranging process. */
				dw_setARER(1);			
				dwt_rxreset();
				dwt_setrxantennadelay(RX_ANT_DLY);
				dwt_settxantennadelay(TX_ANT_DLY);
				dwt_setleds(DWT_LEDS_ENABLE);
				dwt_setrxtimeout(0);
				dwt_setinterrupt( DWT_INT_RFTO | DWT_INT_RFCG, 1);
				/* Activate reception immediately. */
		
	/**************************************************/		
	
while(1)
{
		dwt_configure(&config);
		/* Clear reception timeout to start next ranging process. */
		dw_setARER(1);			
		dwt_rxreset();
		dwt_setrxantennadelay(RX_ANT_DLY);
		dwt_settxantennadelay(TX_ANT_DLY);
		dwt_setleds(DWT_LEDS_ENABLE);
		dwt_setrxtimeout(0);
		dwt_setinterrupt( DWT_INT_RFTO | DWT_INT_RFCG, 1);
	
	
		HAL_TIM_Base_Stop_IT(&htim16);
		//向基站查询时间戳
		POLL_TimeWindow();
		HAL_Delay(1000-localtime%1000);
		HAL_Delay(150*(tag_id[1]-1)+10);
		htim16.Instance->CNT=0;
		flag10s=0;
		syncCnt++;
		HAL_TIM_Base_Start_IT(&htim16);
		dwt_configuresleep(DWT_PRESRV_SLEEP | DWT_CONFIG, DWT_WAKE_CS |DWT_WAKE_WK| DWT_SLP_EN);
		while (1)
	{
		while(dwt_spicswakeup(dummy_buffer, DUMMY_BUFFER_LEN)!=DWT_SUCCESS);
		wearing=0;
		#ifdef NEW
		leftstatus=HAL_GPIO_ReadPin(GPIOA,SENL_INT_Pin);
		rightstatus=HAL_GPIO_ReadPin(GPIOB,SENR_INT_Pin);
		#else
		leftstatus=HAL_GPIO_ReadPin(GPIOA,SENL_P2_Pin)||HAL_GPIO_ReadPin(GPIOA,SENL_P1_Pin);
		rightstatus=HAL_GPIO_ReadPin(GPIOA,SENR_P2_Pin)||HAL_GPIO_ReadPin(GPIOA,SENR_P1_Pin);
		#endif

		if(leftstatus==1&&rightstatus==0)
		{wearing=1;printf("status=%d\r\n",wearing);}
		else if(leftstatus==0&&rightstatus==1)
		{wearing=2;printf("status=%d\r\n",wearing);}
		else if(leftstatus==1&&rightstatus==1)
		{wearing=3;printf("status=%d\r\n",wearing);}
		///07-25 change by liujing
		if(wearing==3)
		{wearing=1;}
		else
		{
			wearing=0;
		}
		
			if (dwt_initialise(DWT_LOADUCODE) == DWT_ERROR)
			{
					printf("INIT FAILED\r\n");
					while (1)
					{ };
			}
			lp_osc_freq = (XTAL_FREQ_HZ / 2) / dwt_calibratesleepcnt();
			sleep_cnt = ((SLEEP_TIME_MS * lp_osc_freq) / 1000) >> 12;
			dwt_configuresleepcnt(sleep_cnt);
			dwt_configure(&config);
				
