kiloser/STM32F0/tag/tag01/Src/main.c
			dwt_setleds(DWT_LEDS_ENABLE);
			/* Apply default antenna delay value. See NOTE 1 below. */
			dwt_setrxantennadelay(RX_ANT_DLY);
			dwt_settxantennadelay(TX_ANT_DLY);
			dwt_setinterrupt( DWT_INT_RFTO | DWT_INT_RXPTO | DWT_INT_RPHE | DWT_INT_RFCE | DWT_INT_RFSL | DWT_INT_SFDT|DWT_INT_RFCG, 1);
			dwt_configuresleep(DWT_PRESRV_SLEEP | DWT_CONFIG, DWT_WAKE_SLPCNT | DWT_SLP_EN);
		
		
			/* USER CODE BEGIN 2 */	
			HAL_Delay(5);
			/* Write frame data to DW1000 and prepare transmission. See NOTE 7 below. */
			dwt_writetxdata(sizeof(tx_poll_msg), tx_poll_msg, 0);
			dwt_writetxfctrl(sizeof(tx_poll_msg), 0,0);
			dwt_setrxtimeout(TIME_OUT_UUS);
			/* Start transmission, indicating that a response is expected so that reception is enabled automatically after the frame is sent and the delay
			 * set by dwt_setrxaftertxdelay() has elapsed. */
			dwt_starttx(DWT_START_TX_IMMEDIATE|DWT_RESPONSE_EXPECTED);
			RF_timeout=0;
			/* We assume that the transmission is achieved correctly, poll for reception of a frame or error/timeout. See NOTE 8 below. */
			while (!interrupt_triggered)
			{ };
		//	interrupt_triggered=0;
		//	status_reg = dwt_read32bitreg(SYS_STATUS_ID);
			/* Increment frame sequence number after transmission of the poll message (modulo 256). */
			memset(&tx_final_msg[FINAL_MSG_RESP_RX_TS_IDX],0,sizeof(tx_final_msg)-FINAL_MSG_RESP_RX_TS_IDX);
				
			
				while(RF_timeout==0)
				{
					while (!interrupt_triggered)
					{ };
					interrupt_triggered=0;
					if (received)
					{
							uint32 frame_len;
							
							received=0;
							/* Clear good TX frame sent in the DW1000 status register. */
							dwt_write32bitreg(SYS_STATUS_ID,SYS_STATUS_TXFRS);
							
							/* A frame has been received, read it into the local buffer. */
							frame_len = dwt_read32bitreg(RX_FINFO_ID) & RX_FINFO_RXFLEN_MASK;
							if (frame_len <= RX_BUF_LEN)
							{
									dwt_readrxdata(rx_buffer, frame_len, 0);
							}

							/* Check that the frame is the expected response from the companion "DS TWR responder" example.
							 * As the sequence number field of the frame is not relevant, it is cleared to simplify the validation of the frame. */
							if (memcmp(rx_buffer, rx_resp_msg, ALL_MSG_COMMON_LEN) == 0)
							{
									final_ok++;
									resp_rx_ts = get_rx_timestamp_u64();
									poll_tx_ts = get_tx_timestamp_u64();
									final_msg_set_ts(&tx_final_msg[FINAL_MSG_POLL_TX_TS_IDX], poll_tx_ts);
									memcpy(&tx_final_msg[FINAL_MSG_RESP_RX_TS_IDX+(final_ok-1)*(FINAL_MSG_TS_LEN
									+ID_LEN)],&rx_buffer[RESP_MSG_ANCHOR_ID_IDX],ID_LEN);
									final_msg_set_ts(&tx_final_msg[FINAL_MSG_RESP_RX_TS_IDX+(final_ok-1)*(FINAL_MSG_TS_LEN
									+ID_LEN)+ID_LEN], resp_rx_ts);
							}
						}
					if(final_ok>=3||RF_timeout>0)
						break;
					dwt_setrxtimeout(TIME_OUT_UUS);
					dwt_rxenable(0);
				}
				if(final_ok)
				{
						final_ok=0;
						for(int j=0;j<10000;j++);
						/* Write and send final message */
						dwt_writetxdata(sizeof(tx_final_msg), tx_final_msg, 0);
						dwt_writetxfctrl(sizeof(tx_final_msg),0,0);
						dwt_starttx(DWT_START_TX_IMMEDIATE);
						while (!(status_reg=dwt_read32bitreg(SYS_STATUS_ID) & SYS_STATUS_TXFRS))
							{ };

						/* Clear TXFRS event. */
						dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_TXFRS);
						for(int j=0;j<20000;j++);

						/*------------------------- send tell message ------------------------------*/	
						final_tx_ts = get_tx_timestamp_u64();
						final_msg_set_ts(&tx_tell_msg[FINAL_MSG_FINAL_TX_TS_IDX], final_tx_ts);	
							
						dwt_writetxdata(sizeof(tx_tell_msg), tx_tell_msg, 0);
						dwt_writetxfctrl(sizeof(tx_tell_msg),0,0);
						dwt_starttx(DWT_START_TX_IMMEDIATE);
						while (!(status_reg=dwt_read32bitreg(SYS_STATUS_ID) & SYS_STATUS_TXFRS))
							{ };

						/* Clear TXFRS event. */
						dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_TXFRS);
				}
				cntx++;
				
				
				
				
//				printf("time :\t %ld\r\n",localtime);
				if((cntx&0x0f)==0)
				{		
					break;
					
				}
				else
				{
					dwt_entersleep();
				}
				while(flag10s==0);
				flag10s=0;
				
					
			//	dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_SLP2INIT);
	}
	


}
}


/* USER CODE BEGIN 1 */
void EXTI2_3_IRQHandler(void)
{ 
	uint32_t status;
	status = dwt_read32bitreg(SYS_STATUS_ID);// Read status register low 32bits
	interrupt_triggered=1;	
	if(status&SYS_STATUS_RXFCG)
	{
		received=1;
		Frame_Ack();
	}
	else if(status & SYS_STATUS_RXRFTO)
			RF_timeout++;
	dwt_write32bitreg(SYS_STATUS_ID, status);
//    } while (HAL_GPIO_ReadPin(DW_IRQ_GPIO_Port,DW_IRQ_Pin) != RESET);
    /* Clear EXTI Line  Pending Bit */
	__HAL_GPIO_EXTI_CLEAR_IT(DW_IRQ_Pin);
		
}



void Frame_Ack(void)
{
	
						/* A frame has been received, read it into the local buffer. */
							len = dwt_read32bitreg(RX_FINFO_ID) & RX_FINFO_RXFLEN_MASK;
							if (len <= RX_BUF_LEN)
							{
									dwt_readrxdata(rx_buffer, len, 0);
							}

							/* Check that the frame is the expected response from the companion "DS TWR responder" example.
							 * As the sequence number field of the frame is not relevant, it is cleared to simplify the validation of the frame. */
							if (rx_buffer[0]==0x26&rx_buffer[1]==0x17&rx_buffer[4]==0x88)
							{
									tx_frame_acked=1;
							}
}
/*! ------------------------------------------------------------------------------------------------------------------
 * @fn POLL_TimeWindow()
 *
 * @brief send poll message to main anchor 
 *  
 *
 * @param  none
 *
 * @return  none
 */

void POLL_TimeWindow(void)
{
	uint32 time=0;
	dwt_write32bitreg(SYS_STATUS_ID,SYS_STATUS_TXFRS|SYS_STATUS_RXFCG|SYS_STATUS_SLP2INIT);//清除标志位
	dwt_setinterrupt(DWT_INT_TFRS|DWT_INT_RFCG|DWT_INT_RFTO,1);//开启中断
	dwt_setrxtimeout(500);//设置接受超时
	dwt_setrxaftertxdelay(0);
	dw_setARER(1);//使能接收机自动重启
	dwt_writetxdata(sizeof(poll_time_msg), poll_time_msg, 0);
	dwt_writetxfctrl(sizeof(poll_time_msg), 0, 0);
	
	do
	{
		
		dwt_starttx(DWT_START_TX_IMMEDIATE|DWT_RESPONSE_EXPECTED);
		dwt_setrxtimeout(TIME_OUT_UUS);
		dwt_rxenable(0);
		while(!tx_frame_acked)
		{
			Delay_ms(20);//如果發送太快太瘋狂，會對基站造成擁堵
			dwt_starttx(DWT_START_TX_IMMEDIATE|DWT_RESPONSE_EXPECTED);
			dwt_setrxtimeout(TIME_OUT_UUS);
			dwt_rxenable(0);
			send_count++;
		}
		
		time=localtime;
		acTime=0;
			if(tx_frame_acked)
		{
						interrupt_triggered=0;
						received=0;
						/* A frame has been received, read it into the local buffer. */
						start_frame_len = dwt_read32bitreg(RX_FINFO_ID) & RX_FINFO_RXFLEN_MASK;
						if (start_frame_len <= RX_BUF_LEN)
						{
							dwt_readrxdata(rx_buffer, start_frame_len, 0);
						}
				
